In [2]:
import sqlite3 
import os
import pandas as pd

In [17]:
#acordarnos de comprobar en qué ruta estamos

os.getcwd()

'c:\\Users\\Usuario\\Desktop\\DATA SCIENCE BOOTCAMP\\Repo clase\\DataScience-Mar2024\\2-Data_Analysis\\6-Bases_de_datos\\SQL'

In [5]:
from sqlalchemy import create_engine

In [18]:

engine = create_engine('sqlite:///Ejercicios\murder_game\data\sql-murder-mystery.db')
engine

Engine(sqlite:///Ejercicios\murder_game\data\sql-murder-mystery.db)

A crime has taken place and the detective needs your help. The detective gave you the crimescene report, but you somehow lost it. You vaguely remember that the crime was a murder thatoccurred sometime on Jan.15, 2018 and that it took place in SQL City. Start by retrieving thecorresponding crime scene report from the police department’s database

In [19]:
query = '''select * from sqlite_master
        where type= "table" 
'''
pd.read_sql(query,con=engine)

,type,name,tbl_name,rootpage,sql
0,table,crime_scene_report,crime_scene_report,2,CREATE TABLE crime_scene_report (\n dat...
1,table,drivers_license,drivers_license,3,CREATE TABLE drivers_license (\n id int...
2,table,person,person,4,CREATE TABLE person (\n id integer PRIM...
3,table,facebook_event_checkin,facebook_event_checkin,5,CREATE TABLE facebook_event_checkin (\n ...
4,table,interview,interview,6,CREATE TABLE interview (\n person_id in...
5,table,get_fit_now_member,get_fit_now_member,7,CREATE TABLE get_fit_now_member (\n id ...
6,table,get_fit_now_check_in,get_fit_now_check_in,9,CREATE TABLE get_fit_now_check_in (\n m...
7,table,income,income,10,CREATE TABLE income (\n ssn integer PRI...
8,table,solution,solution,11,"CREATE TABLE solution (\n user integer,..."

In [24]:
query = '''select * from crime_scene_report
where date like "20180115"
'''
pd.read_sql(query,con=engine)

,date,type,description,city
0,20180115,robbery,A Man Dressed as Spider-Man Is on a Robbery Spree,NYC
1,20180115,murder,Life? Dont talk to me about life.,Albany
2,20180115,murder,"Mama, I killed a man, put a gun against his he...",Reno
3,20180115,theft,Big Bully stole my lunch money!,Chicago
4,20180115,fraud,"Lorem ipsum dolor sit amet, consectetur adipis...",Seattle
5,20180115,assault,"Hamilton: Lee, do you yield? Burr: You shot hi...",SQL City
6,20180115,assault,Report Not Found,SQL City
7,20180115,arson,"like a mouse, you know. But do cats eat bats, ...",San Buenaventura
8,20180115,bribery,"Here the other guinea-pig cheered, and was sup...",Marysville
9,20180115,fraud,The Dormouse slowly opened his eyes. ‘I wasn’t...,Yakima
10,20180115,fraud,King put on his spectacles and looked anxiousl...,Bryan
11,20180115,murder,Security footage shows that there were 2 witne...,SQL City

In [27]:
query = '''select * from crime_scene_report
where date like "20180115" and city like "SQL City" and type like "murder"
'''
pd.read_sql(query,con=engine)

,date,type,description,city
0,20180115,murder,Security footage shows that there were 2 witne...,SQL City

In [31]:
query = '''select distinct description from crime_scene_report
where date like "20180115" and city like "SQL City" and type like "murder"
'''
pd.read_sql(query,con=engine).loc[0,"description"]

'Security footage shows that there were 2 witnesses. The first witness lives at the last house on "Northwestern Dr". The second witness, named Annabel, lives somewhere on "Franklin Ave".'

In [45]:
query = '''select * from person
where address_street_name like "Northwestern Dr"
order by address_number desc
limit 1
'''
pd.read_sql(query,con=engine)

,id,name,license_id,address_number,address_street_name,ssn
0,14887,Morty Schapiro,118009,4919,Northwestern Dr,111564949

In [39]:
query = '''select * from person
where name like "Annabel%" and address_street_name like "Franklin Ave"

'''
pd.read_sql(query,con=engine)

,id,name,license_id,address_number,address_street_name,ssn
0,16371,Annabel Miller,490173,103,Franklin Ave,318771143

In [50]:
query = '''select * from interview
where person_id = "16371"
'''
pd.read_sql(query,con=engine).values

array([[16371,
        'I saw the murder happen, and I recognized the killer from my gym when I was working out last week on January the 9th.']],
      dtype=object)

In [51]:
query = '''select * from interview
where person_id = "14887"
'''
pd.read_sql(query,con=engine).values

array([[14887,
        'I heard a gunshot and then saw a man run out. He had a "Get Fit Now Gym" bag. The membership number on the bag started with "48Z". Only gold members have those bags. The man got into a car with a plate that included "H42W".']],
      dtype=object)

In [68]:

query = '''select * from get_fit_now_check_in
where check_in_date like "20180109"
'''
pd.read_sql(query,con=engine)

  membership_id  check_in_date  check_in_time  check_out_time
0         X0643       20180109            957            1164
1         UK1F2       20180109            344             518
2         XTE42       20180109            486            1124
3         1AE2H       20180109            461             944
4         6LSTG       20180109            399             515
5         7MWHJ       20180109            273             885
6         GE5Q8       20180109            367             959
7         48Z7A       20180109           1600            1730
8         48Z55       20180109           1530            1700
9         90081       20180109           1600            1700

In [59]:
query = '''select * from get_fit_now_member
where membership_status = "gold"
and id like "48Z%"
'''
pd.read_sql(query,con=engine)

      id  person_id           name  membership_start_date membership_status
0  48Z7A      28819   Joe Germuska               20160305              gold
1  48Z55      67318  Jeremy Bowers               20160101              gold

In [ ]:
query = '''select * from get_fit_now_member
where membership_status = "gold"
and id like "48Z%"
'''
pd.read_sql(query,con=engine)

In [65]:
#The man got into a car with a plate that included "H42W".

query = '''select * from drivers_license
where plate_number like "%H42W%" 
'''
pd.read_sql(query,con=engine)

,id,age,height,eye_color,hair_color,gender,plate_number,car_make,car_model
0,183779,21,65,blue,blonde,female,H42W0X,Toyota,Prius
1,423327,30,70,brown,brown,male,0H42W2,Chevrolet,Spark LS
2,664760,21,71,black,black,male,4H42WR,Nissan,Altima

In [75]:
query = '''select * from person
where id like "67318"
'''
pd.read_sql(query,con=engine)

,id,name,license_id,address_number,address_street_name,ssn
0,67318,Jeremy Bowers,423327,530,"Washington Pl, Apt 3A",871539279